# Load modules
read_verilog ../source/ORC_R32I.v
# synthesize for ICE40 FPGA
#synth_ice40 -abc9 -device hx -blif ORC_R32I_syn.blif -edif ORC_R32I_syn.edif -top ORC_R32I
synth_ice40 -abc2 -retime -relut -device hx -blif ORC_R32I_syn.blif -edif ORC_R32I_syn.edif -top ORC_R32I
write_json ORC_R32I_syn.json
# Create a logic diagram and convert to .png image
#show -format png -prefix ./Logic_Diagram
#synth_anlogic -top ORC_R32I
#write_verilog full.v